function setup() {
  createCanvas(600, 400);
  noLoop();
}

function draw() {
  background(135, 206, 235);

  // ---------------- 상의 ----------------
  stroke(0);
  strokeWeight(1.5);
  fill(10, 20, 150);
  rect(110, 330, 380, 120, 50);

  // ---------------- 목 ----------------
  stroke(60);
  strokeWeight(1);
  fill(244, 208, 187);
  rect(265, 285, 70, 60, 6);

  // ---------------- 얼굴 ----------------
  fill(244, 208, 187);
  stroke(60);
  strokeWeight(1.5);
  ellipse(300, 200, 200, 220);

  // ---------------- 머리 ----------------
  noStroke();
  fill(30);
  arc(300, 170, 195, 160, PI, TWO_PI);
  
  fill(244, 208, 187);
  noStroke();
  triangle(320, 170, 323, 170, 320, 130);
  
  fill(244, 208, 187);
  noStroke();
  triangle(315, 170, 312, 170, 313, 130);

  // ---------------- 귀 ----------------
  stroke(60);
  strokeWeight(1);
  fill(244, 208, 187);
  ellipse(190, 200, 20, 34);
  ellipse(410, 200, 20, 34);
  noStroke();
  fill(230, 190, 170);
  ellipse(190, 205, 8, 14);
  ellipse(410, 205, 8, 14);

  // ---------------- 눈 ----------------
  noStroke();
  fill(255);
  ellipse(260, 195, 40, 20);
  ellipse(340, 195, 40, 20);

  fill(0);
  ellipse(260, 195, 12, 12);
  ellipse(340, 195, 12, 12);

  fill(255);
  ellipse(256, 191, 4, 4);
  ellipse(336, 191, 4, 4);

  // ---------------- 눈썹 ----------------
  fill(50);
  noStroke();
  rect(235, 172, 50, 6, 2);
  rect(315, 172, 50, 6, 2);

  // ---------------- 코 ----------------
  noStroke();
  fill(228, 188, 165);
  triangle(294, 230, 306, 230, 300, 205);
  stroke(205, 175, 150);
  strokeWeight(1);
  line(300, 206, 300, 226);

  // ---------------- 입 ----------------
  noStroke();
  fill(180, 50, 60);
  arc(300, 255, 64, 22, 0, PI);
}
